Hamid-R-Tanhaei/Signal-Generator/Firmware_STM32F103c8t6/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define VGA_PWUP_Pin 		GPIO_PIN_12
#define VGA_PWUP_GPIO_Port 	GPIOB
#define VGA_DAT_Pin 		GPIO_PIN_13
#define VGA_DAT_GPIO_Port 	GPIOB
#define VGA_CLK_Pin 		GPIO_PIN_14
#define VGA_CLK_GPIO_Port 	GPIOB
#define VGA_LATCH_Pin 		GPIO_PIN_15
#define VGA_LATCH_GPIO_Port GPIOB
#define DDS_SCLK_Pin 		GPIO_PIN_0
#define DDS_SCLK_GPIO_Port 	GPIOB
#define DDS_DATA_Pin 		GPIO_PIN_1
#define DDS_DATA_GPIO_Port 	GPIOB
#define DDS_RST_Pin 		GPIO_PIN_10
#define DDS_RST_GPIO_Port 	GPIOB
#define DDS_FSYNC_Pin 		GPIO_PIN_7
#define DDS_FSYNC_GPIO_Port GPIOA
#define DDS_FSEL_Pin 		GPIO_PIN_11
#define DDS_FSEL_GPIO_Port  GPIOB
#define LED1_Pin 			GPIO_PIN_1
#define LED1_GPIO_Port 		GPIOA
#define Din_Pin 			GPIO_PIN_3
#define Din_GPIO_Port 		GPIOA
#define SCL1_Pin 			GPIO_PIN_6
#define SCL1_GPIO_Port 		GPIOB
#define SDA1_Pin 			GPIO_PIN_7
#define SDA1_GPIO_Port 		GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
